# 3) Descriptive Statistics - Measures of Central Tendency and variability
Perform the following operations on any open source dataset (e.g., data.csv)
1. Provide summary statistics (mean, median, minimum, maximum, standard deviation) dataset (age, income etc.) with numeric variables grouped by one of the qualitative (categorical) variable. For example, if your categorical variable is age groups and quantitative variable is income, then provide summary statistics of income grouped by the age groups. Create a list that contains a numeric value for each response to the categorical variable.
2. Write a Python program to display some basic statistical details like percentile, mean, standard deviation etc. of the species of ‘Iris-setosa’, ‘Iris-versicolor’ and ‘Iris-versicolor’ of iris.csv dataset.
Provide the codes with outputs and explain everything that you do in this step.

In [66]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import statistics
from sklearn import preprocessing
from sklearn.preprocessing import OneHotEncoder, LabelEncoder

In [67]:
df= pd.read_csv("age_income.csv")

In [68]:
df.head()

   ID          Name  Age  Income Age groups
0   1    John Smith   30   50000     Middle
1   2      Jane Doe   35   60000     Higher
2   3      Alex Lee   28   45000     Middle
3   4   Sarah Brown   42   80000     Higher
4   5  Michael Wang   31   55000     Higher

In [69]:
df.select_dtypes(include='object')

               Name Age groups
0        John Smith     Middle
1          Jane Doe     Higher
2          Alex Lee     Middle
3       Sarah Brown     Higher
4      Michael Wang     Higher
5        Emily Chen     Middle
6     David Johnson     Higher
7     Lisa Thompson     Higher
8      Andrew Davis     Higher
9        Olivia Kim     Middle
10    Sophia Garcia     Higher
11     Ethan Wilson     Higher
12     Mia Thompson     Middle
13     James Miller     Higher
14        Ava Davis     Higher
15   Benjamin Clark     Middle
16    Charlotte Lee     Higher
17  Daniel Anderson     Higher
18    Harper Wilson     Higher
19    Amelia Taylor     Middle

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          20 non-null     int64
 1   Name        20 non-null     object
 2   Age         20 non-null     int64
 3   Income      20 non-null     int64
 4   Age groups  20 non-null     object
dtypes: int64(3), object(2)
memory usage: 928.0+ bytes

In [71]:
df.describe()

             ID        Age        Income
count  20.00000  20.000000     20.000000
mean   10.50000  33.750000  58600.000000
std     5.91608   5.495213  12529.544033
min     1.00000  27.000000  43000.000000
25%     5.75000  29.000000  48000.000000
50%    10.50000  32.500000  57500.000000
75%    15.25000  38.250000  63000.000000
max    20.00000  45.000000  85000.000000

In [72]:
# One-Hot Encoding
encoder = OneHotEncoder()
encoded_data = encoder.fit_transform(df[['Age']])

In [73]:
df.mean()

C:\Users\Reva\AppData\Local\Temp\ipykernel_2092\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

ID           10.50
Age          33.75
Income    58600.00
dtype: float64

In [50]:
df.median()

C:\Users\Reva\AppData\Local\Temp\ipykernel_2092\530051474.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.median()

ID           10.5
Age          32.5
Income    57500.0
dtype: float64

In [51]:
df.mode()

    ID             Name   Age   Income Age groups
0    1         Alex Lee  27.0  58000.0     Higher
1    2    Amelia Taylor  28.0      NaN        NaN
2    3     Andrew Davis  29.0      NaN        NaN
3    4        Ava Davis  31.0      NaN        NaN
4    5   Benjamin Clark   NaN      NaN        NaN
5    6    Charlotte Lee   NaN      NaN        NaN
6    7  Daniel Anderson   NaN      NaN        NaN
7    8    David Johnson   NaN      NaN        NaN
8    9       Emily Chen   NaN      NaN        NaN
9   10     Ethan Wilson   NaN      NaN        NaN
10  11    Harper Wilson   NaN      NaN        NaN
11  12     James Miller   NaN      NaN        NaN
12  13         Jane Doe   NaN      NaN        NaN
13  14       John Smith   NaN      NaN        NaN
14  15    Lisa Thompson   NaN      NaN        NaN
15  16     Mia Thompson   NaN      NaN        NaN
16  17     Michael Wang   NaN      NaN        NaN
17  18       Olivia Kim   NaN      NaN        NaN
18  19      Sarah Brown   NaN      NaN        NaN
19  20    Sophia Garcia   NaN      NaN        NaN

In [52]:
#converting categorical data into numerical data
encoder= preprocessing.LabelEncoder()
df['Age groups']=encoder.fit_transform(df['Age groups'])
df

    ID             Name  Age  Income  Age groups
0    1       John Smith   30   50000           1
1    2         Jane Doe   35   60000           0
2    3         Alex Lee   28   45000           1
3    4      Sarah Brown   42   80000           0
4    5     Michael Wang   31   55000           0
5    6       Emily Chen   27   48000           1
6    7    David Johnson   39   58000           0
7    8    Lisa Thompson   33   58000           0
8    9     Andrew Davis   45   85000           0
9   10       Olivia Kim   29   48000           1
10  11    Sophia Garcia   36   62000           0
11  12     Ethan Wilson   32   58000           0
12  13     Mia Thompson   29   47000           1
13  14     James Miller   41   78000           0
14  15        Ava Davis   34   57000           0
15  16   Benjamin Clark   27   43000           1
16  17    Charlotte Lee   38   66000           0
17  18  Daniel Anderson   31   52000           0
18  19    Harper Wilson   40   76000           0
19  20    Amelia Taylor   28   46000           1

In [53]:
data=df.groupby(['Age groups'])

In [54]:
data.groups.keys()

dict_keys([0, 1])

In [55]:
df.groupby(['Age groups']).std()

C:\Users\Reva\AppData\Local\Temp\ipykernel_2092\1485470022.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(['Age groups']).std()

                  ID       Age        Income
Age groups
0           5.550468  4.516352  10916.348596
1           6.962485  1.112697   2288.688541

In [56]:
df.groupby(['Age groups']).mean()

C:\Users\Reva\AppData\Local\Temp\ipykernel_2092\3788866760.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(['Age groups']).mean()

                   ID        Age        Income
Age groups
0           10.846154  36.692308  65000.000000
1            9.857143  28.285714  46714.285714

In [57]:
df.groupby(['Age groups']).median()

C:\Users\Reva\AppData\Local\Temp\ipykernel_2092\2661902993.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.median is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(['Age groups']).median()

              ID   Age   Income
Age groups
0           11.0  36.0  60000.0
1           10.0  28.0  47000.0

In [58]:
df.groupby(['Age groups'])['Income'].std()

Age groups
0    10916.348596
1     2288.688541
Name: Income, dtype: float64

In [59]:
df.groupby(['Age groups'])['ID'].mean()

Age groups
0    10.846154
1     9.857143
Name: ID, dtype: float64

In [60]:
df.groupby(['Age groups'])['Age'].median()

Age groups
0    36.0
1    28.0
Name: Age, dtype: float64

In [61]:
df.groupby(['Age groups'])['Age'].min()

Age groups
0    31
1    27
Name: Age, dtype: int64

In [62]:
df.groupby(['Age groups'])['Age'].max()

Age groups
0    45
1    30
Name: Age, dtype: int64

In [63]:
df.groupby(['Age groups'])['Age'].var()

Age groups
0    20.397436
1     1.238095
Name: Age, dtype: float64

In [64]:
#df.groupby(["Age groups"])['Income'].agg(pd.Series.mode)
df.groupby(['Age groups'])['Income'].apply(pd.Series.mode)

Age groups
0           0    58000
1           0    48000
Name: Income, dtype: int64

In [65]:
x=np.percentile(df['Age'],25)   
x

29.0